---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.InternalException
source: html/4d2be810-d079-7e5c-1496-8e5232747f18.htm
---
# InternalException Methods

Retrieves data needed to serialize the target object.